"""Выведите каждый элемент в следующем списке:
["Ходячие мертвецы", "Красавцы", "Клан Сопрано", "Дневники вампира"]."""
serials=["Ходячие мертвецы",
         "Красавцы",
         "Клан Сопрано",
         "Дневники вампира"]
for show in serials:
    print(show)
