"""Выведите все числа от 25 до 50"""
for i in range(25, 51):
    print(i)
