"""Задание: Создайте функцию, которая принимает строку
в качестве параметра и возвращает ее."""
h=input("Введите что угодно ")
"""Переводит вводимое значение в строку"""
h=str(h)
def f(h):
    return h
result=f(h)
print(result)
